Revit 2026 API

# IFCFamilyInstanceExtrusionExportResults Methods

---

The IFCFamilyInstanceExtrusionExportResults type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetCutPairOpenings | Gets the set of "openings" determined from the analysis of the instance geometry. |
|  | GetExtrusionHandle | Gets the extruded solid handle generated for the family instance. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

IFCFamilyInstanceExtrusionExportResults Class

Autodesk.Revit.DB.IFC Namespace